[
  {
    "name": "Etch Wafer Loss Quality Engineer / Software Developer  ",
    "date": "2022 - 2024",
    "text": "Provided visionary leadership to a dynamic team of software engineers, fostering collaboration with departmental representatives to review and meticulously analyze processing failures. Formulated strategic action plans to address quality issues proactively.<br> •\tInitiated the establishment of an internal task force dedicated to scrutinizing processing failure modes and reasons. This initiative aimed to enhance communication channels between equipment, processes, and various departmental teams.<br> •\tChampioned an interdepartmental audit of npw particle check SPC limits to ensure alignment with headquarters and customer requests, ensuring harmoniously integrating each unit part.<br> •\tDesigned and led comprehensive training courses on Advanced Process Control (APC) utilization within the Etch department, catering to multiple levels of understanding.<br> •\tDemonstrated unwavering leadership by guiding a group of four new software engineers through multiple department and team organizational changes.<br> •\tSuccessfully orchestrated the migration of multiple applications and databases from a local server to a cloud structure. This strategic move was in response to internal system management and access permission changes within the software development team.<br> •\tPioneered creating a groundbreaking email subscription application, enabling users to preview and control their email and report preferences. Multiple departments have adopted this innovative application method.<br> •\tExercised meticulous oversight by managing and maintaining 28 servers responsible for collecting and scrubbing data from various tool types, crucial for equipment fault analysis and process improvements.<br> •\tServed as the departmental representative in Quality & Reliability's \"Quality Bingo,\" driving quality improvement projects. Through strategic communication via departmental emails and TV slides, the team completed all assignments first and clinched the quality prize for the year.",
    "location": "Samsung Austin SemiConductor (Austin, TX)",
    "animation": "fadeInLeft"
  },
  {
    "name": "Etch Process Layer Owner",
    "date": "2017 - 2022",
    "text": "Provided invaluable mentorship to junior engineers, offering guidance in their daily tasks. Formulated and executed strategic initiatives to enhance process yield and reliability, reduce costs, and mitigate risks while promptly addressing manufacturing challenges.<br> •\tOversaw the seamless integration of new products (NPI) for the BEOL TEL team, including the creation and setup of new devices and support for ongoing new product developments.<br> •\tAssumed accountability for legacy devices (28/32/45nm) in the BEOL, managing their operation on Tokyo Electron (TEL) tools.<br> •\tServed as the team's Advanced Process Control (APC) master, spearheading key initiatives to ensure adherence to product manufacturing requirements and quality control standards.<br> •\tMeticulously monitored critical metro, Yield, and ET trends in collaboration with quality control and team members.<br> •\tDemonstrated leadership in successfully spearheading key projects, such as 5S initiatives, photoresist material changes, and temperature reductions, to address ET failures. Collaborated with external departments to qualify and manage interdepartmental improvement items.<br> •\tAchieved significant reductions in ET/ALPs related to scrap and EQP rundown, elevating production yield within the department and substantially minimizing qualification times to expedite tool return to production post-maintenance.<br> •\tRevolutionized wafer profiling across multiple departments by developing a comprehensive full-shot CD macro for statistical interpretation.<br> •\tUtilized extensive Excel Macro expertise to create multiple tools, providing crucial daily support to the team and department.",
    "location": "Samsung Austin SemiConductor (Austin, TX)",
    "animation": "fadeInLeft"
  },
  {
    "name": "Cartier / Ralph Lauren - Project Assistant",
    "date": "Summer 2016",
    "text": "Helped execute 2 major events during NY Fashion week. Was in charge of initial setup, production / monitoring during the events and teardown.<br> <a href='https://www.wsj.com/articles/ralph-lauren-takes-to-the-street-for-fashion-week-show-1473794635' target='_blank'>Ralph Lauren Madison Ave Show</a><br> <a href='https://www.thecut.com/2016/09/inside-the-cartier-mansion-party-at-new-york-fashion-week.html' target='_blank'>Cartier Re-opening After PArty</a>",
    "location": "Prodject (New York, NY)",
    "animation": "fadeInRight"
  },
  {
    "name": "Victoria Theatre - Scenic Design Assistant",
    "date": "Summer 2015 / Summer 2016",
    "text": "Helped Scenic Designer with the creation of the set for Heathers the Musical and Rocky Horror Picture Show. <br> ",
    "location": "Ray of Light (San Francisco, CA)",
    "animation": "fadeInRight"
  },
  {
    "name": "Pilot Operations Specialist / Statistical Process Controls Engineer ",
    "date": "2015 - 2016",
    "text": "Developed and implemented manufacturing processes, protocols, and SOPs in preparation for the Biotech Startup moving from Series A to Series B funding. Maintained GMP protocols within a class 1000 cleanroom and trained new hires on the various chemical processes and safety regulations. Managed end-to-end wafer production process. Significantly enhanced process reproducibility by establishing a quantitative method to monitor a complex ~4 days process with over 40+ iterations; enabled identification of processing errors in real-time. Monitored environmental variables including temperature and airborne particles, and observed their impact on the process. Conducted time studies of the multiple steps within wafer production from start to finish to determine bottlenecks and areas of improvement based on operator standard deviation. Created statistical documentation by utilizing ellipsometry measurements to interpret complex experimental data and evaluated results. Created and initiated an SPC program utilizing VBA and Excel to monitor products during the manufacturing process following Six Sigma QC standards.",
    "location": "HealthTell (Chandler, AZ)",
    "animation": "fadeInLeft"
  },
  {
    "name": "MILK Studios Fashion Week - Project Assistant",
    "date": "Spring 2015",
    "text": "...",
    "location": "Prodject (New York, NY)",
    "animation": "fadeInRight"
  },
  {
    "name": "Ralph Lauren Polo 4D - Project Assistant",
    "date": "Fall 2014",
    "text": "Assisted in the Ralph Lauren Polo 4D production, primarily creation of a 4D holographic water projector on the lake in order to follow city guidelines and customer requests.<br> <a href='https://youtu.be/0Kk8UTDXbTg?si=G7RO9pB52QlD5qdA' target='_blank'>Ralph Lauren Polo 4D Event Highlights</a>",
    "location": "Prodject (New York, NY)",
    "animation": "fadeInRight"
  },
  {
    "name": "Applications Technician/Research Engineer",
    "date": "2013 - 2014",
    "text": "Developed / implemented a MS Access Program / Database to replace the old paper trail filing system for Quality Control Certificate of Analysis. Enhanced accuracy by creating defense lines which verified measurements were within spec when the QC tests were being inputed into the system. Facilitated data analysis between sites by deploying database nationally. Performed multiple analytical experiments including tests for categorization of resin products and accurately recorded relevant data. Assisted in the installation of complex diagnostics equipment.",
    "location": " (Austin, TX)",
    "animation": "fadeInLeft"
  },
  {
    "name": "Graduated from Worcester Polytechnic Institute",
    "date": "Spring 2012",
    "text": "Graduated with a Bachelor of Science in Chemical Engineering with minors in Math and Physics. Completed my senior capstone project in the field of computational chemistry. <br> <a href='https://digital.wpi.edu/downloads/np193b89c' target='_blank'>DFT Study on Platinum-Ruthenium Catalysts for Use in Methanol Fuel Cells</a>",
    "location": "WPI (Worcester, MA)",
    "animation": "fadeInRight"
  },
  {
    "name": "Unit Operations Teaching Assistant",
    "date": "2011 - 2012",
    "text": "...",
    "location": "WPI (Worcester, MA)",
    "animation": "fadeInLeft"
  },
  {
    "name": "Subway - Assitant Manager",
    "date": "2010 - 2013",
    "text": "...",
    "location": "Subway (Worcester, MA)",
    "animation": "fadeInLeft"
  }
]
