[
  {
    "project": "Platinum-Ruthenium Methanol Fuel Cell",
    "type": " CP2K (Density Functional Theory)",
    "img": "dft.jpg",
    "desc": "Investigated the surface bonding energies of each of the molecules involved in the methanol oxidation reaction on multiple Platinum / Ruthenium surfaces using density functional theory. This analysis can be used to model the efficiencies of various surfaces and help develope an optimal catalyst surface structure for direct methanol fuel cells.",
    "url": "https://digital.wpi.edu/downloads/np193b89c",
    "flipped": false
  },
  {
    "project": "Certificate of Analysis DB",
    "type": "",
    "img": "coa.png",
    "desc": "Used Microsoft Access to create a application/database for Certificate of Analysis (COA) data. This application allows for easy data entry, data retrieval, and data analysis. The application is designed to be user friendly and efficient for the user inputting test results and flagging any items out of spec.",
    "icons": ["fa-brands fa-microsoft", "fa-solid fa-database"],
    "flipped": false
  },
  {
    "project": "Ellipsometry SPC Program",
    "type": "MS Excel Macro / VBA Script",
    "img": "spc.png",
    "desc": "Created a Microsoft Excel macro to automate the Statistical Process Control (SPC) calculations for ellipsometry data. This macro allows for easy data entry and analysis of the data immediately after data entry. The macro also generates a control chart to monitor the process and flag any items out of spec.",
    "icons": ["fa-brands fa-microsoft", "fa-solid fa-database"],
    "flipped": false
  },
  {
    "project": "Wafer Profile Program",
    "type": "MS Excel Macro / VBA Script",
    "img": "waferprofile.jpg",
    "desc": "Created a Microsoft Excel macro to pull, analyze and plot wafer profile data. This macro allowed users to quickly visualize crittical dimensions across the entire wafer as well as pull all images from the databse to see if there are any metrology issues.",
    "icons": ["fa-brands fa-microsoft"],
    "flipped": false
  },
  {
    "project": "Internal Wafer Loss Quality Task Force",
    "type": "Team Leader",
    "img": "5whys.png",
    "desc": "Created a team of representatives from each EQP and Process group to investigate the root cause of internal wafer loss. The team used the 5 Whys method to determine the root causes of the internal wafer loss and developed a plan to reduce quality losses.",
    "icons": ["fa-brands fa-microsoft", "fa-solid fa-database"],
    "flipped": false
  },
  {
    "project": "Personal Portfolio",
    "type": "Vue3 Website Creation",
    "img": "njmport.jpg",
    "desc": "Created personal portfolio website using Vue3. This website is designed to showcase my projects and skills. The website is designed to be user friendly and easy to navigate. The website is also designed to be responsive and work on multiple devices. Originally cloned project from gitlab, moved to gitHub and published using Netlify with domain name bought on porkbun. Many thanks to the original code provider Joy Heurtaux",
    "icons": ["fa-brands fa-vuejs", "fa-brands fa-html5", "fa-brands fa-css3"],
    "url": "https://gitlab.com/Jojo_16/portfolio-vue3",
    "gith": "https://github.com/nealmccloskey/njm-port-vue3",
    "flipped": false
  }
]
